# 9. Membagi `DataFrame` menjadi dua secara acak

In [1]:
# Import all of the necessary packages
import pandas as pd
import numpy as np

## Persiapan `DataFrame`

In [2]:
n_rows = 10
n_cols = 5
cols = list("ABCDE")

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   6  10  17  13   8
1  17  13   4  12  19
2   8  15   2   8  11
3  17   3  15   5  19
4   5   1   9  12   8
5   7   1  16   8   5
6   1  13  18   6  15
7  13  10  12  17   9
8   8  19  13  15   7
9   8  19  17  19  10

## Membagi `DataFrame` menjadi dua secara acak berdasarkan proporsi tertentu

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f"df_1 shape: {df_1.shape}")
print(f"df_2 shape: {df_2.shape}")

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
df_1.reset_index(drop=True)

    A   B   C   D   E
0   7   1  16   8   5
1  17   3  15   5  19
2   8  15   2   8  11
3   1  13  18   6  15
4   8  19  17  19  10
5  13  10  12  17   9
6   6  10  17  13   8

In [6]:
df_2.reset_index(drop=True)

    A   B   C   D   E
0  17  13   4  12  19
1   5   1   9  12   8
2   8  19  13  15   7